app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos" ORDER BY videos.created_at desc
---
  def index
    @videos = Video.all

INSERT INTO "videos" ("created_at", "updated_at", "attach_video_file_name", "attach_video_content_type", "attach_video_file_size", "attach_video_updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]
---
  def destroy
    @video.destroy